import { StarIcon } from "@/icons/StarIcon";
import { Container, Stack, Typography } from "@mui/material";

const terms = () => {
  return (
    <Stack paddingTop="68.5px">
      <Container maxWidth="lg">
        <Stack>
          <Stack
            direction="row"
            alignItems="center"
            justifyContent="start"
            textAlign="center"
            paddingY="16px"
          >
            <StarIcon />
            <Typography fontSize="22px" fontWeight="700">
              Нууцлалын бодлого
            </Typography>
          </Stack>
          <Typography paddingY="24px">
            Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
            албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
            үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
            зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
            вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны
            үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд
            MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид
            хэрэглэгч гэх/ хамтран хяналт тавина. Mstars Food delivery нь Mstars
            Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү
            нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй
            холбоотой үүсэх харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь
            хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө
            хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү
            үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
            гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
            Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
            үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
            хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
            /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
            хамтран хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн
            интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам
            нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
            харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
            авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
            баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн
            хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч
            /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Mstars Food delivery
            нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт
            бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан
            авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино. Энэхүү
            нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ
            өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү
            үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
            гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
            Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
            үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
            хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
            /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
            хамтран хяналт тавина.
          </Typography>
        </Stack>
      </Container>
    </Stack>
  );
};
export default terms;
